import { View, Text } from "react-native";

const DeliveryInfo = () => {
  return (
    <View style={{ marginTop: 30 }}>
      <Text style={{ color: "#272728", fontSize: 12, fontWeight: "400" }}>
        Интернет-магазин выполняет доставку любого товара своей собственной
        Службой доставки
      </Text>

      <Text
        style={{
          marginTop: 20,
          marginBottom: 5,
          color: "#272728",
          fontSize: 14,
          fontWeight: "600",
        }}
      >
        Стоимость доставки курьером по г. Ижевск
      </Text>
      <Text
        style={{
          color: "#272728",
          fontSize: 12,
          fontWeight: "400",
          lineHeight: 15.6,
        }}
      >
        Стоимость доставки при заказе до 1000 р. составляет - 100 р.
      </Text>

      <Text
        style={{
          marginTop: 20,
          color: "#272728",
          fontSize: 12,
          fontWeight: "400",
          lineHeight: 15.6,
        }}
      >
        При заказе более чем на 1000 р. доставка осуществляется бесплатно
      </Text>

      <Text
        style={{
          marginTop: 24,
          marginBottom: 5,
          color: "#272728",
          fontSize: 14,
          fontWeight: "600",
        }}
      >
        Время доставки
      </Text>
      <Text
        style={{
          color: "#272728",
          fontSize: 12,
          fontWeight: "400",
          lineHeight: 15.6,
        }}
      >
        Время доставки согласовывается с менеджером Службы доставки, который
        обязательно свяжется с Вами сразу после того, как Вы разместите свой
        заказ.
      </Text>

      <Text
        style={{
          marginTop: 24,
          marginBottom: 5,
          color: "#898E9F",
          fontSize: 14,
          fontWeight: "600",
        }}
      >
        Внимание!
      </Text>
      <Text
        style={{
          color: "#272728",
          fontSize: 12,
          fontWeight: "400",
          lineHeight: 15.6,
        }}
      >
        Неправильно указанный номер телефона, неточный или неполный адрес могут
        привести к дополнительной задержке! Пожалуйста, внимательно проверяйте
        Ваши персональные данные при регистрации и оформлении
        заказа.Конфиденциальность ваших регистрационных данных гарантируется.
      </Text>

      <Text
        style={{
          marginTop: 15,
          color: "#272728",
          fontSize: 12,
          fontWeight: "400",
          lineHeight: 15.6,
        }}
      >
        Доставка выполняется по понедельникам, средам и пятницам с 12:00 до
        18:00 часов. Товары заказанные Вами в нерабочее время службы доставки,
        будут доставлены Вам в следующий рабочий день службы доставки. Время
        осуществления доставки зависит от времени размещения заказа и наличия
        товара на складе:
      </Text>

      <Text
        style={{
          marginTop: 15,
          color: "#272728",
          fontSize: 12,
          fontWeight: "400",
          lineHeight: 15.6,
        }}
      >
        Вы также можете указать любое другое удобное время доставки, и покупка
        будет доставлена в удобное Вам время. Иное время доставки, а также время
        доставки в населенные пункты области определяется по договоренности с
        клиентом.
      </Text>

      <Text
        style={{
          marginTop: 24,
          marginBottom: 5,
          color: "#272728",
          fontSize: 14,
          fontWeight: "600",
        }}
      >
        Место доставки
      </Text>
      <Text
        style={{
          color: "#272728",
          fontSize: 12,
          fontWeight: "400",
          lineHeight: 15.6,
        }}
      >
        Доставка осуществляется по адресу, указанному при оформлении заказа.
        Если необходимо доставить товар по иному адресу, необходимо сообщить
        адрес менеджеру Службы доставки, который свяжется с Вами непосредственно
        после оформления заказа на сайте.
      </Text>

      <Text
        style={{
          marginTop: 24,
          marginBottom: 5,
          color: "#272728",
          fontSize: 14,
          fontWeight: "600",
        }}
      >
        Доставка по России
      </Text>
      <Text
        style={{
          color: "#272728",
          fontSize: 12,
          fontWeight: "400",
          lineHeight: 15.6,
        }}
      >
        Стоимость доставки по тарифам транспортных компаний: СДЭК.
      </Text>

      <Text
        style={{
          marginTop: 15,
          color: "#272728",
          fontSize: 12,
          fontWeight: "400",
          lineHeight: 15.6,
        }}
      >
        Доставка в регионы насчитывается по расчётам транспортных компаний в
        зависимости от веса и места назначения. Мы работаем с регионами РФ
        только по предоплате.
      </Text>

      <Text
        style={{
          marginTop: 24,
          marginBottom: 5,
          color: "#898E9F",
          fontSize: 14,
          fontWeight: "600",
        }}
      >
        Правила
      </Text>
      <Text
        style={{
          color: "#272728",
          fontSize: 12,
          fontWeight: "400",
          lineHeight: 15.6,
        }}
      >
        При доставке Вам будут переданы все необходимые документы на покупку:
        товарный, кассовый чеки. При оформлении покупки на организацию, Вам
        будут переданы счет-фактура, а также накладная, в которой необходимо
        поставить печать Вашей организации. Цена, указанная в переданных Вам
        курьером документах, является окончательной, курьер не обладает правом
        корректировки цены. Стоимость доставки выделяется в документах на
        покупку отдельной графой.
      </Text>

      <Text
        style={{
          marginTop: 24,
          marginBottom: 5,
          color: "#898E9F",
          fontSize: 14,
          fontWeight: "600",
        }}
      >
        Внимание!
      </Text>
      <Text
        style={{
          color: "#272728",
          fontSize: 12,
          fontWeight: "400",
          lineHeight: 15.6,
        }}
      >
        Просим Вас помнить, что все технические параметры и потребительские
        свойства приобретаемого товара Вам следует уточнять у нашего менеджера
        до момента покупки товара. В обязанности работников Службы доставки не
        входит осуществление консультаций и комментариев относительно
        потребительских свойств товара. При доставке Вам заказанного товара
        проверяйте комплектность доставленного товара, работоспособность товара,
        соответствие доставленного товара описанию на нашем сайте, также
        проверьте товар на наличие механических повреждений. При не заявлении
        Вами при получении товара претензий по поводу механических повреждений,
        в дальнейшем подобные претензии не рассматриваются. В случае вопросов,
        пожеланий и претензий обращайтесь к нам по следующим координатам:
      </Text>

      <Text
        style={{
          marginTop: 24,
          color: "#272728",
          fontSize: 14,
          fontWeight: "600",
        }}
      >
        Служба доставки: 8-905-875-05-50
      </Text>
    </View>
  );
};

export default DeliveryInfo;
